; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v3 ?v10)
             (pred_4 ?v12 ?v6)
             (pred_11 ?v3 ?v6)
             (pred_2 ?v13 ?v3 )
	     (pred_9 ?v3)
             (pred_10 ?v7)
             (pred_12 ?v12)
             (pred_7 ?v6)
             (pred_3 ?v3)
             (pred_5 ?v12)
             (pred_8 ?v3)
             (pred_1 ))



(:action op_2
:parameters (?v5 ?v4 ?v2 ?v1)
:precondition (and (pred_10 ?v5) (pred_10 ?v4) (pred_12 ?v2) (pred_7 ?v1)
          (pred_6 ?v5 ?v4) (pred_4 ?v2 ?v1)
                   (pred_11 ?v4 ?v1) (pred_9 ?v5) 
                   (pred_3 ?v4) (pred_5 ?v2))
:effect (and  (pred_8 ?v4) (not (pred_3 ?v4))))


(:action op_4
:parameters (?v5 ?v11)
:precondition (and (pred_10 ?v5) (pred_10 ?v11)
               (pred_9 ?v5) (pred_6 ?v5 ?v11) (pred_8 ?v11))
:effect (and (pred_9 ?v11) (not (pred_9 ?v5))))

(:action op_3
:parameters (?v5 ?v2)
:precondition (and (pred_10 ?v5) (pred_12 ?v2) 
                  (pred_9 ?v5) (pred_2 ?v2 ?v5) (pred_1 ))
:effect (and (pred_5 ?v2)
   (not (pred_2 ?v2 ?v5)) (not (pred_1 ))))


(:action op_1
:parameters (?v5 ?v9 ?v8)
:precondition (and (pred_10 ?v5) (pred_12 ?v9) (pred_12 ?v8)
                  (pred_9 ?v5) (pred_5 ?v8) (pred_2 ?v9 ?v5))
:effect (and (pred_5 ?v9) (pred_2 ?v8 ?v5)
        (not (pred_5 ?v8)) (not (pred_2 ?v9 ?v5))))

(:action op_5
:parameters (?v5 ?v2)
:precondition (and (pred_10 ?v5) (pred_12 ?v2) 
                  (pred_9 ?v5) (pred_5 ?v2))
:effect (and (pred_1 ) (pred_2 ?v2 ?v5) (not (pred_5 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_01 obj_03 obj_25 obj_16 obj_28 obj_07 obj_04 obj_02 obj_24 obj_18 obj_30 obj_26 obj_10 obj_12 obj_06 obj_21 obj_14 obj_23 obj_08 obj_09 obj_27 obj_29 obj_13 obj_17
    obj_19 obj_20 obj_22
    obj_15 obj_31 obj_11
    )

    (:init
       (pred_1)

       (pred_10 obj_05)
       (pred_10 obj_01)
       (pred_10 obj_03)
       (pred_10 obj_25)
       (pred_10 obj_16)
       (pred_10 obj_28)
       (pred_10 obj_07)
       (pred_10 obj_04)
       (pred_10 obj_02)
       (pred_10 obj_24)
       (pred_10 obj_18)
       (pred_10 obj_30)
       (pred_10 obj_26)
       (pred_10 obj_10)
       (pred_10 obj_12)
       (pred_10 obj_06)
       (pred_10 obj_21)
       (pred_10 obj_14)
       (pred_10 obj_23)
       (pred_10 obj_08)
       (pred_10 obj_09)
       (pred_10 obj_27)
       (pred_10 obj_29)
       (pred_10 obj_13)
       (pred_10 obj_17)
       (pred_7 obj_19)
       (pred_7 obj_20)
       (pred_7 obj_22)
       (pred_12 obj_15)
       (pred_12 obj_31)
       (pred_12 obj_11)

       (pred_6 obj_05 obj_28)
       (pred_6 obj_05 obj_01)
       (pred_6 obj_01 obj_07)
       (pred_6 obj_01 obj_03)
       (pred_6 obj_01 obj_05)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_03 obj_25)
       (pred_6 obj_03 obj_01)
       (pred_6 obj_25 obj_02)
       (pred_6 obj_25 obj_16)
       (pred_6 obj_25 obj_03)
       (pred_6 obj_16 obj_24)
       (pred_6 obj_16 obj_25)
       (pred_6 obj_28 obj_18)
       (pred_6 obj_28 obj_07)
       (pred_6 obj_28 obj_05)
       (pred_6 obj_07 obj_30)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_07 obj_01)
       (pred_6 obj_07 obj_28)
       (pred_6 obj_04 obj_26)
       (pred_6 obj_04 obj_02)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_04 obj_07)
       (pred_6 obj_02 obj_10)
       (pred_6 obj_02 obj_24)
       (pred_6 obj_02 obj_25)
       (pred_6 obj_02 obj_04)
       (pred_6 obj_24 obj_12)
       (pred_6 obj_24 obj_16)
       (pred_6 obj_24 obj_02)
       (pred_6 obj_18 obj_06)
       (pred_6 obj_18 obj_30)
       (pred_6 obj_18 obj_28)
       (pred_6 obj_30 obj_21)
       (pred_6 obj_30 obj_26)
       (pred_6 obj_30 obj_07)
       (pred_6 obj_30 obj_18)
       (pred_6 obj_26 obj_14)
       (pred_6 obj_26 obj_10)
       (pred_6 obj_26 obj_04)
       (pred_6 obj_26 obj_30)
       (pred_6 obj_10 obj_23)
       (pred_6 obj_10 obj_12)
       (pred_6 obj_10 obj_02)
       (pred_6 obj_10 obj_26)
       (pred_6 obj_12 obj_08)
       (pred_6 obj_12 obj_24)
       (pred_6 obj_12 obj_10)
       (pred_6 obj_06 obj_09)
       (pred_6 obj_06 obj_21)
       (pred_6 obj_06 obj_18)
       (pred_6 obj_21 obj_27)
       (pred_6 obj_21 obj_14)
       (pred_6 obj_21 obj_30)
       (pred_6 obj_21 obj_06)
       (pred_6 obj_14 obj_29)
       (pred_6 obj_14 obj_23)
       (pred_6 obj_14 obj_26)
       (pred_6 obj_14 obj_21)
       (pred_6 obj_23 obj_13)
       (pred_6 obj_23 obj_08)
       (pred_6 obj_23 obj_10)
       (pred_6 obj_23 obj_14)
       (pred_6 obj_08 obj_17)
       (pred_6 obj_08 obj_12)
       (pred_6 obj_08 obj_23)
       (pred_6 obj_09 obj_27)
       (pred_6 obj_09 obj_06)
       (pred_6 obj_27 obj_29)
       (pred_6 obj_27 obj_21)
       (pred_6 obj_27 obj_09)
       (pred_6 obj_29 obj_13)
       (pred_6 obj_29 obj_14)
       (pred_6 obj_29 obj_27)
       (pred_6 obj_13 obj_17)
       (pred_6 obj_13 obj_23)
       (pred_6 obj_13 obj_29)
       (pred_6 obj_17 obj_08)
       (pred_6 obj_17 obj_13)
       (pred_3 obj_08)
       (pred_3 obj_25)
       (pred_3 obj_14)
       (pred_11  obj_08 obj_19)
       (pred_11  obj_25 obj_20)
       (pred_11  obj_14 obj_22)
       (pred_8 obj_05)
       (pred_8 obj_01)
       (pred_8 obj_03)
       (pred_8 obj_16)
       (pred_8 obj_28)
       (pred_8 obj_07)
       (pred_8 obj_04)
       (pred_8 obj_02)
       (pred_8 obj_24)
       (pred_8 obj_18)
       (pred_8 obj_30)
       (pred_8 obj_26)
       (pred_8 obj_10)
       (pred_8 obj_12)
       (pred_8 obj_06)
       (pred_8 obj_21)
       (pred_8 obj_23)
       (pred_8 obj_09)
       (pred_8 obj_27)
       (pred_8 obj_29)
       (pred_8 obj_13)
       (pred_8 obj_17)

       (pred_4  obj_15 obj_19)
       (pred_4  obj_31 obj_20)
       (pred_4  obj_11 obj_22)
       (pred_2 obj_15 obj_05)
       (pred_2 obj_31 obj_18)
       (pred_2 obj_11 obj_04)
       (pred_9 obj_13)
    )

    (:goal (and
       (pred_2 obj_15 obj_30)
       (pred_2 obj_31 obj_29)
    ))
(:constraints
  (always (not (pred_9 obj_07)))
)
)

; plan
1. (op_4 obj_13 obj_29)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_29)
   goals met: 0 of 2
2. (op_4 obj_29 obj_27)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_27)
   goals met: 0 of 2
3. (op_4 obj_27 obj_21)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_21)
   goals met: 0 of 2
4. (op_4 obj_21 obj_30)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_30)
   goals met: 0 of 2
5. (op_4 obj_30 obj_18)
   deleted: (pred_9 obj_30)
   added: (pred_9 obj_18)
   goals met: 0 of 2
6. (op_3 obj_18 obj_31)
   deleted: (pred_2 obj_31 obj_18) (pred_1)
   added: (pred_5 obj_31)
   goals met: 0 of 2
7. (op_4 obj_18 obj_28)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_28)
   goals met: 0 of 2
8. (op_4 obj_28 obj_05)
   deleted: (pred_9 obj_28)
   added: (pred_9 obj_05)
   goals met: 0 of 2
9. (op_1 obj_05 obj_15 obj_31)
   deleted: (pred_5 obj_31) (pred_2 obj_15 obj_05)
   added: (pred_5 obj_15) (pred_2 obj_31 obj_05)
   goals met: 0 of 2
10. (op_4 obj_05 obj_28)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_28)
   goals met: 0 of 2
11. (op_4 obj_28 obj_18)
   deleted: (pred_9 obj_28)
   added: (pred_9 obj_18)
   goals met: 0 of 2
12. (op_4 obj_18 obj_30)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_30)
   goals met: 0 of 2
13. (op_5 obj_30 obj_15)
   deleted: (pred_5 obj_15)
   added: (pred_1) (pred_2 obj_15 obj_30)
   goals met: 1 of 2
14. (op_4 obj_30 obj_18)
   deleted: (pred_9 obj_30)
   added: (pred_9 obj_18)
   goals met: 1 of 2
15. (op_4 obj_18 obj_28)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_28)
   goals met: 1 of 2
16. (op_4 obj_28 obj_05)
   deleted: (pred_9 obj_28)
   added: (pred_9 obj_05)
   goals met: 1 of 2
17. (op_3 obj_05 obj_31)
   deleted: (pred_2 obj_31 obj_05) (pred_1)
   added: (pred_5 obj_31)
   goals met: 1 of 2
18. (op_4 obj_05 obj_28)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_28)
   goals met: 1 of 2
19. (op_4 obj_28 obj_18)
   deleted: (pred_9 obj_28)
   added: (pred_9 obj_18)
   goals met: 1 of 2
20. (op_4 obj_18 obj_30)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_30)
   goals met: 1 of 2
21. (op_4 obj_30 obj_21)
   deleted: (pred_9 obj_30)
   added: (pred_9 obj_21)
   goals met: 1 of 2
22. (op_4 obj_21 obj_27)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_27)
   goals met: 1 of 2
23. (op_4 obj_27 obj_29)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_29)
   goals met: 1 of 2
24. (op_5 obj_29 obj_31)
   deleted: (pred_5 obj_31)
   added: (pred_1) (pred_2 obj_31 obj_29)
   goals met: 2 of 2
